In [5]:
import pandas as pd
import numpy as np
from env import user, password, host

In [6]:
#3
def get_db_url(user,password,host,database_name):
    url =  f'mysql+pymysql://{user}:{password}@{host}/{database_name}'
    return url

In [7]:
#4 create url
url = get_db_url(user, password, host, 'employees')

In [8]:
#5
pd.read_sql('''
SELECT * 
FROM employees 
LIMIT 5''', url)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [ ]:
#5a error message from typo in url
url = get_db_url(user, password, host, 'employee')
pd.read_sql('''
SELECT * 
FROM employees 
LIMIT 5''', url)

In [ ]:
#OperationalError: (pymysql.err.OperationalError) 
#(1044, "Access denied for user 'oneil_2102'@'%' to database 'employee'")

In [ ]:
#5b typo in query
url = get_db_url(user, password, host, 'employees')
pd.read_sql('''
SELECT * 
FROM emp 
LIMIT 5''', url)

In [ ]:
#1146, "Table 'employees.emp' doesn't exist"

In [13]:
#6
url = get_db_url(user, password, host, 'employees')
df1 = pd.read_sql('''
SELECT * 
FROM employees 
''', url)

In [14]:
url = get_db_url(user, password, host, 'employees')
df2 = pd.read_sql('''
SELECT * 
FROM titles 
''', url)

In [15]:
#7 number of rows and columns
df1.shape

(300024, 6)

In [16]:
df2.shape

(443308, 4)

In [18]:
#8 more info
df1.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [19]:
df2.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [22]:
#9 unique titles in titles
df2['title'].unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

In [24]:
df2.title.nunique()

7

In [26]:
#10 oldest dat in to_date
df2.to_date.min()

datetime.date(1985, 3, 1)

In [27]:
#11 most recent date in the to_date
df2.to_date[df2.to_date != df2.to_date.max()].max()

datetime.date(2002, 8, 1)